#ifndef CUBE_H
#define CUBE_H

#include<glad//glad.h>

struct Cube {
	// Интерливированный (interleaved) массив вершинных атрибутов: Позиция (vec3), Цвет (vec3) и Текстура (vec2)
	inline static const GLfloat vertices[] = {
		// Позиция (X, Y, Z)     // Цвет (R, G, B)        // Текстура (U, V)

		// --- ПЕРЕДНЯЯ ГРАНЬ
		-0.5f, -0.5f,  0.5f,     1.0f, 1.0f, 0.0f,        0.5f, 0.5f, // 0
		 0.5f, -0.5f,  0.5f,     0.0f, 1.0f, 0.0f,        1.0f, 0.5f, // 1
		 0.5f,  0.5f,  0.5f,     1.0f, 0.0f, 0.0f,        1.0f, 1.0f, // 2
		-0.5f,  0.5f,  0.5f,     0.0f, 1.0f, 1.0f,        0.5f, 1.0f, // 3

		// --- ЗАДНЯЯ ГРАНЬ
		-0.5f, -0.5f, -0.5f,     1.0f, 1.0f, 0.0f,        1.0f, 0.5f, // 4
		 0.5f, -0.5f, -0.5f,     0.0f, 1.0f, 0.0f,        0.5f, 0.5f, // 5
		 0.5f,  0.5f, -0.5f,     1.0f, 0.0f, 0.0f,        0.5f, 1.0f, // 6
		-0.5f,  0.5f, -0.5f,     0.0f, 1.0f, 1.0f,        1.0f, 1.0f, // 7

		// --- ЛЕВАЯ ГРАНЬ
		-0.5f, -0.5f, -0.5f,     1.0f, 1.0f, 0.0f,        0.5f, 0.5f, // 8
		-0.5f, -0.5f,  0.5f,     0.0f, 1.0f, 0.0f,        1.0f, 0.5f, // 9
		-0.5f,  0.5f,  0.5f,     1.0f, 0.0f, 0.0f,        1.0f, 1.0f, // 10
		-0.5f,  0.5f, -0.5f,     0.0f, 1.0f, 1.0f,        0.5f, 1.0f, // 11

		// --- ПРАВАЯ ГРАНЬ
		 0.5f, -0.5f, -0.5f,     1.0f, 1.0f, 0.0f,        1.0f, 0.5f, // 12
		 0.5f, -0.5f,  0.5f,     0.0f, 1.0f, 0.0f,        0.5f, 0.5f, // 13
		 0.5f,  0.5f,  0.5f,     1.0f, 0.0f, 0.0f,        0.5f, 1.0f, // 14
		 0.5f,  0.5f, -0.5f,     0.0f, 1.0f, 1.0f,        1.0f, 1.0f, // 15

		 // --- НИЖНЯЯ ГРАНЬ
		 -0.5f, -0.5f, -0.5f,     1.0f, 1.0f, 0.0f,        0.0f, 0.0f, // 16
		  0.5f, -0.5f, -0.5f,     0.0f, 1.0f, 0.0f,        0.5f, 0.0f, // 17
		  0.5f, -0.5f,  0.5f,     1.0f, 0.0f, 0.0f,        0.5f, 0.5f, // 18
		 -0.5f, -0.5f,  0.5f,     0.0f, 1.0f, 1.0f,        0.0f, 0.5f, // 19

		 // --- ВЕРХНЯЯ ГРАНЬ
		 -0.5f,  0.5f, -0.5f,     1.0f, 1.0f, 0.0f,        0.0f, 0.5f, // 20
		  0.5f,  0.5f, -0.5f,     0.0f, 1.0f, 0.0f,        0.5f, 0.5f, // 21
		  0.5f,  0.5f,  0.5f,     1.0f, 0.0f, 0.0f,        0.5f, 1.0f, // 22
		 -0.5f,  0.5f,  0.5f,     0.0f, 1.0f, 1.0f,        0.0f, 1.0f  // 23
	};


	// Индексный массив (Element Array) для явного указания топологии примитивов
	inline static const GLuint indices[] = {
		0,  1,  2,     0,  2,  3,  // Передняя
		4,  5,  6,     4,  6,  7,  // Задняя
		8,  9,  10,    8,  10, 11, // Левая
		12, 13, 14,    12, 14, 15, // Правая
		16, 17, 18,    16, 18, 19, // Нижняя
		20, 21, 22,    20, 22, 23  // Верхняя
	};
};

#endif
